measurely-api/archive/scala-api_v2.2_OLD/app/controllers/clients_controller.rb

  def show
    @clients = Client.find(params[:id])
---
SELECT  "client".* FROM "client" WHERE "client"."client_id" = $1 LIMIT $2  [["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]

  def edit
    @client = Client.find(params[:id])
---
SELECT  "client".* FROM "client" WHERE "client"."client_id" = $1 LIMIT $2  [["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]

  def create
    @client = Client.new(client_params)

    if @client.save
---
INSERT INTO "client" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-04-06 09:07:57.099887"], ["updated_at", "2019-04-06 09:07:57.099887"]]

  def update
    if @client.update(client_params.permit(:first_name, :last_name, :sex, :birth_date, :postcode, :marital_status, :sexuality, :ethnicity, :indigenous, :children, :workforce_status, :education))
---
UPDATE "client" SET "workforce_status" = $1, "education" = $2, "updated_at" = $3 WHERE "client"."client_id" = $4  [["workforce_status", "Working Part-Time"], ["education", "Secondary Education"], ["updated_at", "2019-05-06 12:11:47.020691"], ["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"]]

  def destroy
    @client.destroy
---
DELETE FROM "client" WHERE "client"."id" = $1  [["id", "63f72744-2586-447b-8415-8803592e77d9"]]

    def set_client
      @client = Client.find(params[:id])
---
SELECT  "client".* FROM "client" WHERE "client"."client_id" = $1 LIMIT $2  [["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]