measurely-api/archive/scala-api_v2.2_OLD/app/controllers/scale_controller.rb

  def index
    @scales = Scale.clinician_id_equals(@clinician_id).includes(:client)
---
SELECT  "client".* FROM "client" WHERE "client"."client_id" = $1 ORDER BY "client"."id" DESC LIMIT $2  [["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]
SELECT  "scale".* FROM "scale" WHERE "scale"."client_id" = $1 ORDER BY "scale"."id" DESC LIMIT $2  [["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]

  def show
    @scales = Scale.find(params[:id])
---
SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]

  def edit
    @scale = Scale.find(params[:id])
---
SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]

  def destroy
    @scale.destroy
---
DELETE FROM "scale" WHERE "scale"."id" = $1  [["id", "7fac3aeb-3103-4138-ac7f-05c801bb4bb0"]]

    def set_scale
      @scale = Scale.find(params[:id])
---
SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]