measurely-api/scala-api_v2/app/controllers/scale_controller.rb

  def index
    @scales = Scale.clinician_id_equals(@clinician_id).includes(:client)
---
SELECT  "client".* FROM "client" WHERE "client"."client_id" = $1 LIMIT $2  [["client_id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]
SELECT "scale".* FROM "scale" INNER JOIN "client" ON "client"."id" = "scale"."client_id" WHERE (scale.client_id = client.client_id) ORDER BY scale.date

  def show
    @scales = Scale.find(params[:id])
---
SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]

  def edit
    @scale = Scale.find(params[:id])
---
SELECT  "scale".* FROM "scale" WHERE "scale"."scale_id" = $1 LIMIT $2  [["scale_id", "0264bc3d-6c27-456e-9bcd-65df2831f39c"], ["LIMIT", 1]]

  def update
    if @scale.update(scale_params)
---
UPDATE "scale" SET "score" = $1, "updated_at" = $2 WHERE "scale"."scale_id" = $3  [["score", 3], ["updated_at", "2019-05-17 00:12:21.951689"], ["scale_id", "0264bc3d-6c27-456e-9bcd-65df2831f39c"]]

  def destroy
    @scale.destroy
---
DELETE FROM "scale" WHERE "scale"."id" = $1  [["id", "7fac3aeb-3103-4138-ac7f-05c801bb4bb0"]]

    def set_scale
      @scale = Scale.find(params[:id])
---
SELECT  "scale".* FROM "scale" WHERE "scale"."scale_id" = $1 LIMIT $2  [["scale_id", "0264bc3d-6c27-456e-9bcd-65df2831f39c"], ["LIMIT", 1]]