measurely-api/archive/scala-api/app/controllers/clients_controller.rb

SELECT "client".* FROM "client" WHERE (clinician_id = '6ce964cd-7c63-4561-9da3-cc2629085fdd')
SELECT  "client".* FROM "client" WHERE "client"."id" = $1 LIMIT $2  [["id", "0576204e-f74c-4597-a6d1-cf87d1782277"], ["LIMIT", 1]]
---
  def index
    @clients = Client.all
    @user = session[:userinfo]
    @clinician_id = @user['uid']
    @clinician_id.to_s
    @clinician_id = @clinician_id[6..30]
    clinicican = params[:clinicican]
    @clients = @clients.where("clinician_id = '#{@clinician_id}'", clinicican)

SELECT  "client".* FROM "client" WHERE "client"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @clients = Client.find(params[:id])

SELECT  "client".* FROM "client" WHERE "client"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @client = Client.find(params[:id])

INSERT INTO "client" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-04-06 09:07:57.099887"], ["updated_at", "2019-04-06 09:07:57.099887"]]
---
  def create
    @client = Client.new(client_params)

    if @client.save

UPDATE "client" SET "first_name" = $1, "last_name" = $2, "sex" = $3, "birth_date" = $4, "postcode" = $5, "marital_status" = $6, "sexuality" = $7, "ethnicity" = $8, "indigenous" = $9, "children" = $10, "workforce_status" = $11, "updated_at" = $12 WHERE "client"."id" = $13
---
  def update
    if @client.update(client_params.permit(:first_name, :last_name, :sex, :birth_date, :postcode, :marital_status, :sexuality, :ethnicity, :indigenous, :children, :workforce_status))

DELETE FROM "client" WHERE "client"."id" = $1  [["id", "63f72744-2586-447b-8415-8803592e77d9"]]
---
  def destroy
    @client.destroy

SELECT  "client".* FROM "client" WHERE "client"."id" = $1 LIMIT $2  [["id", "63f72744-2586-447b-8415-8803592e77d9"], ["LIMIT", 1]]
---
    def set_client
      @client = Client.find(params[:id])