measurely-api/archive/scala-api/app/controllers/scale_controller.rb

SELECT "scale".* FROM "scale" WHERE (clinician_id = '5c99f47197d7ec57ff84527e') ORDER BY date DESC
SELECT "scale".* FROM "scale" WHERE (clinician_id = '6ce964cd-7c63-4561-9da3-cc2629085fdd')
---
  def index
    @scales = Scale.all.order('date DESC')
    @user = session[:userinfo]
    @clinician_id = @user['uid']
    @clinician_id.to_s
    @clinician_id = @clinician_id[6..30]
    clinicican = params[:clinicican]
  	@scales = @scales.where("clinician_id = '#{@clinician_id}'", clinicican)

SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]
---
  def show
    @scales = Scale.find(params[:id])

SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]
---
  def edit
    @scale = Scale.find(params[:id])

DELETE FROM "scale" WHERE "scale"."id" = $1  [["id", "7fac3aeb-3103-4138-ac7f-05c801bb4bb0"]]
---
  def destroy
    @scale.destroy

SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]
---
    def set_scale
      @scale = Scale.find(params[:id])