measurely-api/archive/scala-api_v3/app/controllers/scale_controller.rb

SELECT "client".* FROM "client" WHERE "client"."client_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)
SELECT "scale".* FROM "scale" INNER JOIN "client" ON "client"."id" = "scale"."client_id" WHERE (scale.client_id = client.client_id) ORDER BY scale.date
---
  def index
    @scales = Scale.clinician_id_equals(@clinician_id).includes(:client)

SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]
---
  def show
    @scales = Scale.find(params[:id])

SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]
---
  def edit
    @scale = Scale.find(params[:id])

DELETE FROM "scale" WHERE "scale"."id" = $1  [["id", "7fac3aeb-3103-4138-ac7f-05c801bb4bb0"]]
---
  def destroy
    @scale.destroy

SELECT  "scale".* FROM "scale" WHERE "scale"."id" = $1 LIMIT $2  [["id", "d62822d0-5694-43a0-adfd-408c3dd62d34"], ["LIMIT", 1]]
---
    def set_scale
      @scale = Scale.find(params[:id])