measurely-api/archive/scala-api_v3/app/views/scale/index.html.erb

SELECT  "client".* FROM "client" WHERE "client"."id" = $1 LIMIT $2  [["id", "074c4b58-86c2-4a8c-a3ba-0ee7ae61c63a"], ["LIMIT", 1]]
---
                    <tr>
                        <td><%= scale.client.first_name %></td>